tap "caskformula/caskformula"
tap "homebrew-zathura/zathura"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "jimeh/emacs-builds"
tap "koekeishiya/formulae"
tap "lusingander/tap"
tap "macos-fuse-t/cask"
brew "icu4c@76"
brew "openssl@3"
brew "autoconf"
brew "openjdk"
brew "briss"
brew "cmake"
brew "cookiecutter"
brew "coreutils"
brew "eza"
brew "fd"
brew "gnutls"
brew "ffmpeg"
brew "fzf"
brew "gnu-sed"
brew "go"
brew "graphviz"
brew "hadolint"
brew "pkgconf"
brew "hdf5"
brew "helix"
brew "htop"
brew "imagemagick"
brew "jansson"
brew "jq"
brew "krb5"
brew "libffi"
brew "libgccjit"
brew "libiconv"
brew "libxml2"
brew "libxrandr"
brew "llvm"
brew "ltex-ls-plus"
brew "luajit"
brew "luarocks"
brew "mailutils"
brew "make"
brew "markdownlint-cli"
brew "marksman"
brew "ncspot"
brew "neovim"
brew "nushell"
brew "nvm"
brew "qscintilla2"
brew "sundials"
brew "octave"
brew "opam"
brew "openapi-generator"
brew "openjdk@17"
brew "openvpn"
brew "poppler"
brew "postgresql@14", restart_service: :changed
brew "prettier"
brew "pv"
brew "pygments", link: false
brew "pyvim"
brew "ripgrep"
brew "ruby"
brew "sevenzip"
brew "stow"
brew "swift"
brew "tmux"
brew "tree"
brew "vale"
brew "wget"
brew "xcodegen"
brew "zlib"
brew "zola"
brew "zoxide"
brew "homebrew-zathura/zathura/zathura", args: ["with-synctex"]
brew "jesseduffield/lazygit/lazygit"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "lusingander/tap/serie"
cask "alfred"
cask "alt-tab"
cask "anaconda"
cask "authy"
cask "balenaetcher"
cask "cryptomator"
cask "docker"
cask "dropbox"
cask "ferdium"
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-symbols-only-nerd-font"
cask "fuse-t"
cask "fuse-t-sshfs"
cask "google-chrome"
cask "hazel"
cask "hiddenbar"
cask "inkscape"
cask "iterm2"
cask "jetbrains-toolbox"
cask "krisp"
cask "obsidian"
cask "qbittorrent"
cask "rstudio"
cask "sf-symbols"
cask "signal"
cask "slack"
cask "spotify"
cask "steam"
cask "the-unarchiver"
cask "ubersicht"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "wezterm"
cask "zed"
cask "zoom"
cask "zotero"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "bodil.file-browser"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "cschlosser.doxdocgen"
vscode "dtsvet.vscode-wasm"
vscode "esbenp.prettier-vscode"
vscode "gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "jacobdufault.fuzzy-search"
vscode "james-yu.latex-workshop"
vscode "jeff-hykin.better-cpp-syntax"
vscode "kahole.magit"
vscode "mathematic.vscode-latex"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.test-adapter-converter"
vscode "nickfode.latex-formatter"
vscode "oderwat.indent-rainbow"
vscode "ritwickdey.liveserver"
vscode "saoudrizwan.claude-dev"
vscode "shyykoserhiy.vscode-spotify"
vscode "sswg.swift-lang"
vscode "tecosaur.latex-utilities"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vspacecode.vspacecode"
vscode "vspacecode.whichkey"
vscode "wayou.vscode-todo-highlight"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
