tap "browsh-org/browsh"
tap "caskformula/caskformula"
tap "homebrew-zathura/zathura"
tap "iwe-org/iwe"
tap "jesseduffield/lazygit"
tap "kanriapp/cask"
tap "koekeishiya/formulae"
tap "largemodgames/spotatui"
tap "lusingander/tap"
tap "macos-fuse-t/cask"
tap "stripe/stripe-cli"
brew "zstd"
brew "openssl@3"
brew "autoconf"
brew "openjdk"
brew "briss"
brew "cloc"
brew "cmake"
brew "cookiecutter"
brew "coreutils"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "icu4c@76"
brew "fzf"
brew "gemini-cli"
brew "gnu-sed"
brew "gnutls"
brew "go"
brew "graphviz"
brew "hadolint"
brew "pkgconf"
brew "hdf5"
brew "hello"
brew "htop"
brew "httrack"
brew "imagemagick"
brew "jansson"
brew "jq"
brew "krb5"
brew "lazygit"
brew "libffi"
brew "libgccjit"
brew "libiconv"
brew "libxml2"
brew "libxrandr"
brew "llvm"
brew "ltex-ls-plus"
brew "luajit"
brew "luarocks"
brew "mailutils"
brew "make"
brew "markdown-oxide"
brew "markdownlint-cli"
brew "marksman"
brew "ncspot"
brew "neovim"
brew "nushell"
brew "nvm"
brew "qscintilla2"
brew "sundials"
brew "octave"
brew "opam"
brew "openapi-generator"
brew "openjdk@17"
brew "openvpn"
brew "poppler"
brew "prettier"
brew "pv"
brew "pygments"
brew "pyvim"
brew "ripgrep"
brew "ruby"
brew "scooter"
brew "sevenzip"
brew "spotify_player"
brew "stow"
brew "swift"
brew "tmux"
brew "tree"
brew "vale"
brew "wget"
brew "xcodegen"
brew "zlib"
brew "zola"
brew "zoxide"
brew "browsh-org/browsh/browsh"
brew "homebrew-zathura/zathura/zathura", args: ["with-synctex"]
brew "homebrew-zathura/zathura/zathura-pdf-mupdf"
brew "iwe-org/iwe/iwe"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "lusingander/tap/serie"
brew "stripe/stripe-cli/stripe"
cask "alfred"
cask "alt-tab"
cask "balenaetcher"
cask "cryptomator"
cask "docker-desktop"
cask "dropbox"
cask "ferdium"
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-symbols-only-nerd-font"
cask "fuse-t"
cask "macos-fuse-t/cask/fuse-t-sshfs"
cask "google-chrome"
cask "hazel"
cask "hiddenbar"
cask "inkscape"
cask "iterm2"
cask "jetbrains-toolbox"
cask "krisp"
cask "obsidian"
cask "sf-symbols"
cask "signal"
cask "slack"
cask "spotify"
cask "steam"
cask "super-productivity"
cask "the-unarchiver"
cask "ubersicht"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "wezterm"
cask "zed"
cask "zoom"
cask "zotero"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "bodil.file-browser"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "cschlosser.doxdocgen"
vscode "docker.docker"
vscode "dtsvet.vscode-wasm"
vscode "esbenp.prettier-vscode"
vscode "gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "jacobdufault.fuzzy-search"
vscode "james-yu.latex-workshop"
vscode "jeff-hykin.better-cpp-syntax"
vscode "kahole.magit"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mathematic.vscode-latex"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.test-adapter-converter"
vscode "nickfode.latex-formatter"
vscode "oderwat.indent-rainbow"
vscode "ritwickdey.liveserver"
vscode "saoudrizwan.claude-dev"
vscode "shyykoserhiy.vscode-spotify"
vscode "sswg.swift-lang"
vscode "swiftlang.swift-vscode"
vscode "tecosaur.latex-utilities"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vspacecode.vspacecode"
vscode "vspacecode.whichkey"
vscode "wayou.vscode-todo-highlight"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
cargo "bat"
cargo "bottom"
cargo "cargo-edit"
cargo "cargo-steel-lib"
cargo "cargo-watch"
cargo "codebook-lsp"
cargo "coreutils"
cargo "du-dust"
cargo "exa"
cargo "fd-find"
cargo "git-delta"
cargo "git-graph"
cargo "gitui"
cargo "helix-term"
cargo "ripgrep"
cargo "rustlings"
cargo "selene"
cargo "simple-completion-language-server"
cargo "spotify_player"
cargo "steel-forge"
cargo "steel-interpreter"
cargo "steel-language-server"
cargo "tealdeer"
cargo "texlab"
cargo "wasm-bindgen-cli"
cargo "workshop-runner"
cargo "zoxide"
npm "@anthropic-ai/claude-code"
npm "@openai/codex"
npm "corepack"
