tap "caskformula/caskformula"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
brew "openssl@3"
brew "autoconf"
brew "briss"
brew "cmake"
brew "cookiecutter"
brew "emacs"
brew "fzf"
brew "gnu-sed"
brew "graphviz"
brew "hadolint"
brew "hdf5"
brew "helix"
brew "htop"
brew "libomp"
brew "imagemagick"
brew "krb5"
brew "llvm"
brew "luarocks"
brew "markdownlint-cli"
brew "ncspot"
brew "neovim", args: ["HEAD"]
brew "nushell"
brew "nvm"
brew "octave"
brew "opam"
brew "openapi-generator"
brew "openvpn"
brew "poppler"
brew "postgresql@14"
brew "stow"
brew "tmux"
brew "tree"
brew "vale"
brew "wget"
brew "zola"
brew "jesseduffield/lazygit/lazygit"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "alfred"
cask "alt-tab"
cask "anaconda"
cask "authy"
cask "balenaetcher"
cask "cryptomator"
cask "docker"
cask "dropbox"
cask "ferdium"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "hazel"
cask "hiddenbar"
cask "inkscape"
cask "iterm2"
cask "jetbrains-toolbox"
cask "krisp"
cask "mullvadvpn"
cask "obsidian"
cask "qbittorrent"
cask "rstudio"
cask "sf-symbols"
cask "signal"
cask "slack"
cask "spotify"
cask "steam"
cask "the-unarchiver"
cask "ubersicht"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "wezterm"
cask "zed"
cask "zoom"
cask "zotero"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "cschlosser.doxdocgen"
vscode "dtsvet.vscode-wasm"
vscode "esbenp.prettier-vscode"
vscode "gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "jacobdufault.fuzzy-search"
vscode "james-yu.latex-workshop"
vscode "jeff-hykin.better-cpp-syntax"
vscode "kahole.magit"
vscode "mathematic.vscode-latex"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.test-adapter-converter"
vscode "nickfode.latex-formatter"
vscode "ritwickdey.liveserver"
vscode "shyykoserhiy.vscode-spotify"
vscode "tecosaur.latex-utilities"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vspacecode.vspacecode"
vscode "vspacecode.whichkey"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
